; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v7)
             (pred_12 ?v12 ?v6)
             (pred_9 ?v3 ?v6)
             (pred_1 ?v5 ?v3 )
	     (pred_4 ?v3)
             (pred_11 ?v10)
             (pred_10 ?v12)
             (pred_3 ?v6)
             (pred_7 ?v3)
             (pred_5 ?v12)
             (pred_6 ?v3)
             (pred_2 ))



(:action op_4
:parameters (?v13 ?v4 ?v8 ?v2)
:precondition (and (pred_11 ?v13) (pred_11 ?v4) (pred_10 ?v8) (pred_3 ?v2)
          (pred_8 ?v13 ?v4) (pred_12 ?v8 ?v2)
                   (pred_9 ?v4 ?v2) (pred_4 ?v13) 
                   (pred_7 ?v4) (pred_5 ?v8))
:effect (and  (pred_6 ?v4) (not (pred_7 ?v4))))


(:action op_1
:parameters (?v13 ?v11)
:precondition (and (pred_11 ?v13) (pred_11 ?v11)
               (pred_4 ?v13) (pred_8 ?v13 ?v11) (pred_6 ?v11))
:effect (and (pred_4 ?v11) (not (pred_4 ?v13))))

(:action op_3
:parameters (?v13 ?v8)
:precondition (and (pred_11 ?v13) (pred_10 ?v8) 
                  (pred_4 ?v13) (pred_1 ?v8 ?v13) (pred_2 ))
:effect (and (pred_5 ?v8)
   (not (pred_1 ?v8 ?v13)) (not (pred_2 ))))


(:action op_5
:parameters (?v13 ?v9 ?v1)
:precondition (and (pred_11 ?v13) (pred_10 ?v9) (pred_10 ?v1)
                  (pred_4 ?v13) (pred_5 ?v1) (pred_1 ?v9 ?v13))
:effect (and (pred_5 ?v9) (pred_1 ?v1 ?v13)
        (not (pred_5 ?v1)) (not (pred_1 ?v9 ?v13))))

(:action op_2
:parameters (?v13 ?v8)
:precondition (and (pred_11 ?v13) (pred_10 ?v8) 
                  (pred_4 ?v13) (pred_5 ?v8))
:effect (and (pred_2 ) (pred_1 ?v8 ?v13) (not (pred_5 ?v8)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_04 obj_06 obj_12 obj_13 obj_02 obj_08 obj_03 obj_11
    obj_01 obj_09
    obj_05 obj_07
    )

    (:init
       (pred_2)

       (pred_11 obj_10)
       (pred_11 obj_04)
       (pred_11 obj_06)
       (pred_11 obj_12)
       (pred_11 obj_13)
       (pred_11 obj_02)
       (pred_11 obj_08)
       (pred_11 obj_03)
       (pred_11 obj_11)
       (pred_3 obj_01)
       (pred_3 obj_09)
       (pred_10 obj_05)
       (pred_10 obj_07)

       (pred_8 obj_10 obj_12)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_06 obj_02)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_12 obj_08)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_12 obj_10)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_02 obj_06)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_08 obj_03)
       (pred_8 obj_08 obj_12)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_08)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_03)
       (pred_7 obj_11)
       (pred_7 obj_06)
       (pred_9  obj_11 obj_01)
       (pred_9  obj_06 obj_09)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_13)
       (pred_6 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_03)

       (pred_12  obj_05 obj_01)
       (pred_12  obj_07 obj_09)
       (pred_1 obj_05 obj_13)
       (pred_1 obj_07 obj_08)
       (pred_4 obj_13)
    )

    (:goal (and
       (pred_1 obj_07 obj_13)
    ))
(:constraints
  (always (not (pred_4 obj_12)))
)
)

; plan
1. (op_1 obj_13 obj_03)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_03)
   goals met: 0 of 1
2. (op_1 obj_03 obj_08)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_08)
   goals met: 0 of 1
3. (op_3 obj_08 obj_07)
   deleted: (pred_1 obj_07 obj_08) (pred_2)
   added: (pred_5 obj_07)
   goals met: 0 of 1
4. (op_1 obj_08 obj_03)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_03)
   goals met: 0 of 1
5. (op_1 obj_03 obj_13)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_13)
   goals met: 0 of 1
6. (op_5 obj_13 obj_05 obj_07)
   deleted: (pred_5 obj_07) (pred_1 obj_05 obj_13)
   added: (pred_5 obj_05) (pred_1 obj_07 obj_13)
   goals met: 1 of 1
